#print(start:end:step)
str2 = 'Neverland'
print(str2[:]) # весь список
print(str2[0:10:1]) # весь список
print(str2[::]) # весь список
print(str2[::2])# нечётные по порядку элементы
print(str2[0:10:2]) # нечётные по порядку элементы
print(str2[1:9:2]) # чётные по порядку элементы
print(str2[1::2]) # чётные по порядку элементы
print(str2[-1:-10:-1]) # все элементы в обратном порядке
print(str2[::-1]) # все элементы в обратном порядке
print(str2[:-10:-1]) # все элементы в обратном порядке
print(str2[5:]) # все элементы, начиная с шестого
print(str2[5:10:]) # все элементы, начиная с шестого
print(str2[5:10:1]) # все элементы, начиная с шестого
print(str2[:5]) # все элементы, не доходя до шестого
print(str2[0:5:1]) # все элементы, не доходя до шестого
print(str2[0:5]) #все элементы, не доходя до шестого
print(str2[-1:1:-1]) # все элементы от предпоследнего до второго в обратном порядке
print(str2[-2:1:-1]) # все элементы от предпоследнего до третьего в обратном порядке
