n = int(input("n находится в диапазоне от 1 до 99:"))
if 1>=n<5 or 20<n<=21 or 30<n<=31 or 40<n<=41 or 50<n<=51 or 60<n<=61 or 70<n<=71 or 80<n<=81 or 90<n<=91:
    print("мне",n,"год")
elif 4<n<21 or 24<n<=30 or 34<n<=40 or 44<n<=50 or 54<n<=60 or 64<n<= 70 or 74<n<=80 or 84<n<=90 or 94<n<=99:
    print("мне",n,"лет")
elif 1<n<5 or 21<n<=24 or 31<n<=34 or 41<n<=44 or 51<n<=54 or 61<n<=64 or 71<n<=74 or 81<n<=84 or 91<n<=94:
    print("мне",n,"года")
else:
    print("Возраст указан не верно, отдохни Старичок:")